app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = 1
---
	def new
		@orders = current_user.orders.all

INSERT INTO "orders" ("created_at", "item_description", "item_price", "merchant_address", "merchant_name", "purchase_count", "purchaser_name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
	def upload
		if params[:file]
			regexp = /([^\t]+|\t(?=\t)|\t$)\s([^\t]+|\t(?=\t)|\t$)\s([^\t]+|\t(?=\t)|\t$)\s([^\t]+|\t(?=\t)|\t$)\s([^\t]+|\t(?=\t)|\t$)\s([^\t]+|\t(?=\t)|\t$)/

  		lines = params[:file].tempfile.readlines.map(&:chomp)
			lines.shift
			lines.each do |l|
				m = l.match(regexp)
				@order = current_user.orders.create({ purchaser_name: m[1], item_description: m[2], item_price: m[3],purchase_count: m[4], merchant_address: m[5], merchant_name: m[6] })